In [1]:
import pandas as pd

In [2]:
students_data = {
    "Name" : ["Muheet" ,"Anas", "Saad", "Razan", "Zaeema", "Hamza", "Tabish", "Usman"],
    "Age": [14, 17, 18, 19, 15, 21, 19,18],
    "Score" : [99, 88, 77, 98, 87,87, 98, 87] 
}

print(students_data)

students_df = pd.DataFrame(students_data)

print(students_df)

{'Name': ['Muheet', 'Anas', 'Saad', 'Razan', 'Zaeema', 'Hamza', 'Tabish', 'Usman'], 'Age': [14, 17, 18, 19, 15, 21, 19, 18], 'Score': [99, 88, 77, 98, 87, 87, 98, 87]}
     Name  Age  Score
0  Muheet   14     99
1    Anas   17     88
2    Saad   18     77
3   Razan   19     98
4  Zaeema   15     87
5   Hamza   21     87
6  Tabish   19     98
7   Usman   18     87

In [4]:
students_df

     Name  Age  Score
0  Muheet   14     99
1    Anas   17     88
2    Saad   18     77
3   Razan   19     98
4  Zaeema   15     87
5   Hamza   21     87
6  Tabish   19     98
7   Usman   18     87

In [5]:
students_df['Name']

0    Muheet
1      Anas
2      Saad
3     Razan
4    Zaeema
5     Hamza
6    Tabish
7     Usman
Name: Name, dtype: object

In [6]:
students_df['Age']

0    14
1    17
2    18
3    19
4    15
5    21
6    19
7    18
Name: Age, dtype: int64

In [7]:
students_df.loc[2]

Name     Saad
Age        18
Score      77
Name: 2, dtype: object

In [8]:
students_df.loc[0]

Name     Muheet
Age          14
Score        99
Name: 0, dtype: object

In [9]:
students_df[['Name', 'Score']]

     Name  Score
0  Muheet     99
1    Anas     88
2    Saad     77
3   Razan     98
4  Zaeema     87
5   Hamza     87
6  Tabish     98
7   Usman     87